# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Ultralytics RT-DETR-l hybrid object detection model with P2/4 - P5/32 outputs (4-scale)
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes (VisDrone)
scales: # model compound scaling constants
  l: [1.00, 1.00, 1024]

# ======================== 半监督配置（Semi-DETR改进版） ========================
semi:
  teacher1_path: 'runs/teacher_training/RTDETR-Teacher/weights/best.pt'

  # 伪标签阈值
  conf_thresh: 0.25
  min_pseudo_conf: 0.25

  # Cost过滤参数
  cost_alpha: 1.0
  cost_beta: 6.0

  use_gmm_filtering: true
  covariance_type: 'full'

  # EMA更新参数
  ema_decay: 0.9996
  ema_warm_up: 2000

  # 分阶段混合匹配参数
  warm_up_step: 60000

  # 无监督损失权重 - 关键修改！
  burn_up_steps: 40000
  initial_unsup_weight: 0.1
  max_unsup_weight: 0.5
  weight_increment: 0.0
  steps_per_epoch: 1479

backbone:
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]]  # stage 1
  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]]  # stage 2
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 4-P3/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # stage 3
  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 8-P4/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]  # stage 4

# Head（4尺度版本：P2-P5）
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 12, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 14 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # 16, fpn_blocks.0

  - [-1, 1, Conv, [256, 1, 1]]  # 17, Y4, lateral_convs.1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 19 input_proj.0
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # 21, fpn_blocks.1

  # === 新增：P2特征层（4-scale的关键） ===
  - [-1, 1, Conv, [256, 1, 1]]  # 22, Y3, lateral_convs.2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 24 input_proj.0
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # 26, fpn_blocks.2 (新增)

  # === 下采样路径：从P2开始 ===
  - [-1, 1, Conv, [256, 3, 2]]  # 27, downsample_convs.2
  - [[-1, 22], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # 29, pan_blocks.2 (新增)

  - [-1, 1, Conv, [256, 3, 2]]  # 30, downsample_convs.1
  - [[-1, 21], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # 32, pan_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]  # 33, downsample_convs.0
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # 35, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]  # 36, downsample_convs.0 (P5)
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # 38, pan_blocks.0 (P5)

  # Decoder：现在有4个尺度[26, 29, 32, 35]
  - [[26, 29, 32, 38], 1, RTDETRDecoder, [nc]]  # Detect(P2, P3, P4, P5)